---
kind: property
id: P:Autodesk.Revit.DB.Material.SurfaceForegroundPatternColor
zh: 材质、材料
source: html/d9019c51-64ee-caab-aa04-51b594074ec1.htm
---
# Autodesk.Revit.DB.Material.SurfaceForegroundPatternColor Property

**中文**: 材质、材料

The color of the material surface foreground pattern.

## Syntax (C#)
```csharp
public Color SurfaceForegroundPatternColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null